src/cf/DataProcessors/ор_ЗагрузкаДанныхИзТабличногоДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ор_ЗагрузкаДанныхИзТабличногоДокумента</Name>
			<Comment>Загрузка данных из табличного документа</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТаблицаЗагружаемыхРеквизитов</Name>
					<Comment>Таблица загружаемых реквизитов</Comment>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретСозданияНовыхЭлементов</Name>
					<Comment>Флаг Не создавать новых элементов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяНумерацияКолонокТабличногоДокумента</Name>
					<Comment>Ручная нумерация колонок табличного документа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяСтрокаДанныхТабличногоДокумента</Name>
					<Comment>Первая строка данных табличного документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗагрузки</Name>
					<Comment>Режим загрузки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаИсточника</Name>
					<Comment>Ссылка источника</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабличнаяЧастьИсточника</Name>
					<Comment>Табличная часть источника</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабличнаяЧастьДокументаОбъекта</Name>
					<Comment>Табличная часть документа объекта</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередЗаписьюОбъекта</Name>
					<Comment>Перед записью объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриЗаписиОбъекта</Name>
					<Comment>При записи объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПослеДобавленияСтроки</Name>
					<Comment>После добавления строки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВидаРегистра</Name>
					<Comment>Имя вида регистра</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗамещатьСуществующиеЗаписи</Name>
					<Comment>Замещать существующие записи</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабличнаяЧастьОбъекта</Name>
					<Comment>Табличная часть объекта</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флПоискПоПрайсуПоставщика</Name>
					<Comment>Поиск по прайсу поставщика</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогАрхиваЗагруженныхФайлов</Name>
					<Comment>Каталог архива загруженных файлов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействиеСЗагружаемымФайлом</Name>
					<Comment>Действие с загружаемым файлом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСправочника</Name>
					<Comment>Имя справочника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретОбновленияСуществующихЭлементов</Name>
					<Comment>Флаг Не обновлять существующие элементы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Табуляция</Name>
					<Comment>Разделитель между колонками для текстовых документов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегдаФормироватьНовыеСерии</Name>
					<Comment>Всегда формировать новые серии</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаДополнительныхПараметров</Name>
					<Comment>Таблица дополнительных параметров</Comment>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматДатыСрокаГодности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьПроизводителя</Name>
					<Comment>Создавать производителя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВнешнийМодульПреобразованияФайла</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеФормироватьДопНомерСерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаПреобразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабличныйДокумент</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьШК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТЧДокумента</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОбъект</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДополнительныеРеквизитыИСведения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеРеквизитыИСведенияТолькоОбщие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеРеквизитыПоКатегорииНоменклатуры</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаЗагружаемыхРеквизитовШапки</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяНумерацияКолонокТабличногоДокументаДляШапки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерваяСтрокаДанныхШапки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШКЯвляетсяПолемПоискаНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьШКДляНовойНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьШКДляНовойХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНеОбрабатываемыхСтрок</Name>
					<Comment>Последняя строка данных табличного документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьОбщиеХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьСтрануПроисхождения</Name>
					<Comment>Создавать страну происхождения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьGTINДляСерии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствиеНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеДляПоиска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСтавкиНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСтавокНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенийБольшеОдного</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПроисхождения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ор_Производители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроизводительЛС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/ор_ЗагрузкаДанныхИзТабличногоДокумента/Forms/ФормаПодбораПоДокументу/Ext/Form/Module.bsl
&НаКлиенте
Перем ДанныеПеренесены;

&НаКлиенте
Перем ВыполняетсяЗакрытие;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого СтрокаКоллекции Из Параметры.КоллекцияСтрок Цикл 
		Если СтрокаКоллекции.Загружать И НЕ ЗначениеЗаполнено(СтрокаКоллекции.Номенклатура) Тогда
			НоваяСтрока = ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКоллекции);
		КонецЕсли;
	КонецЦикла;
	
	НоменклатурыЗаказа = Параметры.Документ.Товары.ВыгрузитьКолонку("Номенклатура");
	Для Каждого Номенклатура Из НоменклатурыЗаказа Цикл
		НаденныеСтроки = Параметры.КоллекцияСтрок.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));
		Если НаденныеСтроки.Количество() = 0 Тогда
			НовСтрока = ТаблицаНоменклатур.Добавить();
			НовСтрока.Номенклатура = Номенклатура;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ВыполняетсяЗакрытие Тогда
		
		Если ЗавершениеРаботы Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если НЕ ДанныеПеренесены И ЕстьСопоставленнаяНоменклатура() Тогда
			Отказ = Истина;
			ТекстВопроса = "Обнаружена сопоставленная номенклатура. При закрытии формы данные будут утеряны. Закрыть форму?";
			Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Нет);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоставитьСоответствие(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоставитьСоответствие(Команда)
	
	ТекСтрокаНоменклатур = Элементы.ТаблицаНоменклатур.ТекущиеДанные;
	ТекСтрокаДанных      = Элементы.ТаблицаДанных.ТекущиеДанные;
	
	Если ТекСтрокаНоменклатур = Неопределено Или ТекСтрокаДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекСтрокаНоменклатур.Сопоставлено Тогда
		СтрокаДанных = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанных, ТекСтрокаНоменклатур);
		
		ТекСтрокаНоменклатур.Наименование = "";
		ТекСтрокаНоменклатур.НомерСтроки = 0;
		ТекСтрокаНоменклатур.Сопоставлено = Ложь;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ТекСтрокаНоменклатур, ТекСтрокаДанных);
	ТекСтрокаНоменклатур.Сопоставлено = Истина;
	ТаблицаДанных.Удалить(ТекСтрокаДанных);
	ТаблицаДанных.Сортировать("НомерСтроки");
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьСоответствие(Команда)
	
	ТекСтрокаНоменклатур = Элементы.ТаблицаНоменклатур.ТекущиеДанные;
	Если ТекСтрокаНоменклатур = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекСтрокаНоменклатур.Сопоставлено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДанных = ТаблицаДанных.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДанных, ТекСтрокаНоменклатур);
	
	ТекСтрокаНоменклатур.Наименование = "";
	ТекСтрокаНоменклатур.НомерСтроки = 0;
	ТекСтрокаНоменклатур.Сопоставлено = Ложь;
	
	ТаблицаДанных.Сортировать("НомерСтроки");
	
КонецПроцедуры

&НаКлиенте
Процедура ИзСписка(Команда)
	
	ПараметрыФормы = Новый Структура("ТаблицаДанных, ОткрытаИзФормыПодбораПоДокументу", ТаблицаДанных, Истина);
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормаПодбораНоменклатуры", ЭтотОбъект);
	Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ОткрытьФорму("Обработка.ор_ЗагрузкаДанныхИзТабличногоДокумента.Форма.ФормаПодбораНоменклатуры", ПараметрыФормы,,,,, ОбработчикОповещения, Режим);
	
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	
	Если НЕ ЕстьСопоставленнаяНоменклатура() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не обнаружено ни одной сопоставленной номенклатуры!");
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаНоменклатур Из ТаблицаНоменклатур Цикл
		Если НЕ СтрокаНоменклатур.Сопоставлено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = СопоставленныеДанные.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНоменклатур);
		
		ДанныеПеренесены = Истина;
	КонецЦикла;
	
	Закрыть(СопоставленныеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОповещениеОткрытьФормаПодбораНоменклатуры(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТаблицыДанных = ТаблицаДанных.НайтиСтроки(Новый Структура("Наименование", Результат))[0].ПолучитьИдентификатор();
	Если СтрокаТаблицыДанных<>Неопределено Тогда
		Элементы.ТаблицаДанных.ТекущаяСтрока = СтрокаТаблицыДанных;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьСопоставленнаяНоменклатура()
	
	Результат = Ложь;
	Для Каждого ТекСтрока Из ТаблицаНоменклатур Цикл
		Если ТекСтрока.Сопоставлено Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

ДанныеПеренесены = Ложь;
ВыполняетсяЗакрытие = Ложь;
